{
	"$GLOBALS": {
		"description": "An associative array containing references to all variables which are currently defined in the global scope of the script. The variable names are the keys of the array.",
		"type": "array"
	},
	"$_SERVER": {
		"description": "$_SERVER is an array containing information such as headers, paths, and script locations. The entries in this array are created by the web server. There is no guarantee that every web server will provide any of these; servers may omit some, or provide others not listed here. That said, a large number of these variables are accounted for in the CGI/1.1 specification, so you should be able to expect those.",
		"type": "array"
	},
	"$_GET": {
		"description": "An associative array of variables passed to the current script via the URL parameters.",
		"type": "array"
	},
	"$_POST": {
		"description": "An associative array of variables passed to the current script via the HTTP POST method.",
		"type": "array"
	},
	"$_FILES": {
		"description": "An associative array of items uploaded to the current script via the HTTP POST method.",
		"type": "array"
	},
	"$_REQUEST": {
		"description": "An associative array that by default contains the contents of $_GET, $_POST and $_COOKIE.",
		"type": "array"
	},
	"$_SESSION": {
		"description": "An associative array containing session variables available to the current script. See the Session functions documentation for more information on how this is used.",
		"type": "array"
	},
	"$_ENV": {
		"description": "An associative array of variables passed to the current script via the environment method. \r\n\r\nThese variables are imported into PHP\"s global namespace from the environment under which the PHP parser is running. Many are provided by the shell under which PHP is running and different systems are likely running different kinds of shells, a definitive list is impossible. Please see your shell\"s documentation for a list of defined environment variables. \r\n\r\nOther environment variables include the CGI variables, placed there regardless of whether PHP is running as a server module or CGI processor.",
		"type": "array"
	},
	"$_COOKIE": {
		"description": "An associative array of variables passed to the current script via HTTP Cookies.",
		"type": "array"
	},
	"$php_errormsg": {
		"description": "$php_errormsg is a variable containing the text of the last error message generated by PHP. This variable will only be available within the scope in which the error occurred, and only if the track_errors configuration option is turned on (it defaults to off).",
		"type": "array"
	},
	"$HTTP_RAW_POST_DATA": {
		"description": "$HTTP_RAW_POST_DATA contains the raw POST data. See always_populate_raw_post_data",
		"type": "array"
	},
	"$http_response_header": {
		"description": "The $http_response_header array is similar to the get_headers() function. When using the HTTP wrapper, $http_response_header will be populated with the HTTP response headers. $http_response_header will be created in the local scope.",
		"type": "array"
	},
	"$argc": {
		"description": "Contains the number of arguments passed to the current script when running from the command line.",
		"type": "array"
	},
	"$argv": {
		"description": "Contains an array of all the arguments passed to the script when running from the command line.",
		"type": "array"
	},
	"$this": {
		"description": "Refers to the current object",
		"type": "array"
	},
	"parent": {
		"description": "",
		"type": ""
	},
	"self": {
		"description": "",
		"type": ""
	},
	"_destruct": {
		"description": "",
		"type": ""
	}

}