<!DOCTYPE html>
<html>

    <head>
        <meta charset="utf-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
        <title>COM COMEN&Ccedil;AR AMB BRACKETS</title>
        <meta name="description" content="Una guia interactiva sobre com comen&ccedil;ar amb Brackets.">
        <link rel="stylesheet" href="main.css">
    </head>
    
    <body>

        <h1>COM COMEN&Ccedil;AR AMB BRACKETS</h1>
        <h2>Aquesta &eacute;s la teva guia!</h2>
        
        <!--
            FET AMB <3 I JAVASCRIPT
        -->

        <p>
            Benvingut a una versi&oacute; preliminar de Brackets, un nou editor de codi obert per a la nova
            generaci&oacute; d'Internet. Som uns apassionats dels est&agrave;ndards i volem construir millors
            eines per a JavaScript, HTML, CSS i la resta de tecnologies web. Aquest &eacute;s el nostre humil
            comen&ccedil;ament.
        </p>

        <!--
            QUE &Eacute;S BRACKETS?
        -->
        <p>
            <em>Brackets &eacute;s un editor diferent.</em>
            La gran difer&egrave;ncia &eacute;s que est&agrave; escrit en JavaScript, HTML i CSS. 
            Aix&ograve; vol dir que la majoria de les persones que fan servir Brackets tenen 
            les habilitats necess&agrave;ries per a modificar i expandir aquest editor. De fet, nosaltres
            el fem servir di&agrave;riament per a desenvolupar Brackets. Tamb&eacute; t&eacute; 
            algunes caracter&iacute;stiques &uacute;niques com per exemple l'Edici&oacute; R&agrave;pida,
            el Desenvolupament en Temps Real i m&eacute;s eines que no trobar&agrave;s en altres editors.
            Segueix llegint per a aprendre com treure-li profit a aquestes caracter&iacute;stiques.
        </p>
        
        <h2>Estem intentant algunes coses noves</h2>
        
        <!--
            LA RELACIÓN ENTRE HTML, CSS I JAVASCRIPT
        -->
        <h3>Edici&oacute; R&agrave;pida de CSS i JavaScript</h3>
        <p>
            Ja no haur&agrave;s de saltar de document en document perdent de vista el que est&agrave;s fent. 
            Mentre escrius HTML, fes servir la drecera <kbd>Cmd/Ctrl + E</kbd> per obrir l'editor d'edici&oacute; 
            r&agrave;pida en l&iacute;nia amb tot el contingut CSS relacionat amb l'etiqueta, ID, o classe 
            seleccionada. 
            Ajusta el teu CSS i pressiona <kbd>ESC</kbd> per a tornar al HTML, o simplement
            mant&eacute; les normes CSS obertes perqu&egrave; passin a formar part del teu editor HTML. 
            Si pressiones <kbd>ESC</kbd> fora de l'editor r&agrave;pid, aquest es tancar&agrave;.
        </p>

        <samp>
            Vols veure'l funcionant? Col&middot;loca el cursor sobre l'etiqueta <!-- <samp> --> i fes 
            <kbd>Cmd/Ctrl + E</kbd>. Hauries de veure l'editor r&agrave;pid de CSS m&eacute;s amunt, mostrant la 
            norma CSS que l'afecta. L'edici&oacute; r&agrave;pida funciona tamb&eacute; amb ID i classes. Pots crear noves 
            normes de la mateixa manera. Fes clic en una de les etiquetes <!-- <p> --> que hi ha m&eacute;s amunt i fes 
            <kbd>Cmd/Ctrl + E</kbd>. Encara no hi ha cap norma per a aquest element, per&ograve; pots fer clic 
            en el bot&oacute; <strong>Nova Norma</strong> per a afegir una nova norma a les etiquetes <!-- <p> -->.
        </samp>
        
        <a href="screenshots/quick-edit.png">
            <img alt="Una captura de pantalla amb l'Editor Rapid de CSS" src="screenshots/quick-edit.png" />
        </a>
        
        <p>
            Tamb&eacute; pots fer servir la mateixa drecera per a editar altres coses (com, per exemple, funcions en 
            JavaScript, colors i funcions de temporitzaci&oacute; d'animacions) i estem afegint m&eacute;s i m&eacute;s
            novetats cont&iacute;nuament. Ara mateix, no es poden niar editors en l&iacute;nia, aix&iacute; que 
            nom&eacute;s pots fer servir l'Edici&oacute; R&agrave;pida quan el cursor es troba dins l'editor "complet".
        </p>

        <!--
            DESENVOLUPAMENT EN TEMPS REAL
        -->
        <h3>Visualitza canvis en arxius HTML i CSS en temps real en el navegador</h3>
        <p>
            Coneixes el ball de "guardar/recarregar" que portem fent des de fa anys? Aquell en el que fas canvis en el teu
            editor, guardes, vas al navegador i recarregues per a poder veure el resultat? Amb Brackets, aix&ograve; s'ha 
            acabat!
        </p>
        <p>
            Brackets obrir&agrave; una <em>connexi&oacute; a temps real</em> amb el teu navegador i li enviar&agrave;
            els canvis de l'arxiu HTML i CSS mentre escrius codi! Pot ser que ja facis quelcom similar amb les eines de
            desenvolupament del navegador, per&ograve; amb Brackets ja no necessites copiar i enganxar el codi final un
            altre cop a l'editor. El teu codi s'executa en el navegador, per&ograve; viu en el teu editor!
        </p>
        
        <h3>Destacament en viu d'elements HTML i normes CSS</h3>
        <p>
            Brackets t'ajuda a veure com els canvis en HTML i CSS afecten la teva p&agrave;gina. Quan el cursor es trobi
            sobre una norma de CSS, Brackets destacar&agrave; tots els elements afectats al navegador. 
            De la mateixa manera, quan estiguis editant un arxiu HTML, Brackets tamb&eacute; destacar&agrave; els elements
            corresponents en el navegador.
        </p>

        <samp>
            Si tens instal&middot;lat Google Chrome, pots probar-ho tu mateix. Fes clic sobre la icona del llamp de la
            cantonada superior dreta o pressiona <kbd>Cmd/Ctrl + Alt + P</kbd>. Quan el Desenvolupament en Temps Real
            est&agrave; funcionant en un document HTML, tots els documents CSS relacionats es poden editar en
            temps real. La icona passar&agrave; de gris a daurat quan Brackets estableixi una connexi&oacute;
            amb el navegador.
            
            Ara, col&middot;loca el cursor sobre l'etiqueta <!-- <img> --> que es troba una mica m&eacute;s amunt. Observa
            com apareix el ressaltat blau al voltant de la imatge en el navegador. Despr&eacute;s, utilitza 
            <kbd>Cmd/Ctrl + E</kbd> per a obrir les normes de CSS existents. Intenta canviar la mida del 'border' 
            de 10 a 20 píxels, o el color del fons de "transparent" a "hotpink". Si Brackets i el navegador estan
            funcionant en paral&middot;lel, veur&agrave; els canvis instant&agrave;niament en el navegador.
            Genial, ¿no?
        </samp>
        
        <p class="note">
            Actualment, Brackets nom&eacute;s suporta Desenvolupament en Temps Real per a HTML i CSS. Tot i aix&iacute;, 
            en la versi&oacute; actual, els canvis en arxius JavaScript s&oacute;n detectats i recarregats 
            autom&agrave;ticament en el navegador quan guardes. En aquests moments estem treballant per a  afegir suport 
            per al Desenvolupament en Temps Real per a JavaScript. A m&eacute;s, les actualitzacions autom&agrave;tiques 
            nom&eacute;s s&oacute;n possibles amb Google Chrome, per&ograve; esperem poder traslladar pr&ograve;ximament 
            aquesta funcionalitat a tots els grans navegadors.
        </p>
        
        <h3>Vista R&agrave;pida</h3>
        <p>
            Per a aquells que encara no han memoritzat les equival&egrave;ncies de color entre Hex i RGB, Brackets permet
            veure exactament quin color s'est&agrave; fent servir r&agrave;pidament. Tant en CSS com en HTML, simplement 
            posa el cursor sobre qualsevol valor de color o gradient i Brackets mostrar&agrave; una previsualitzaci&ograve; 
            d'aquest de manera autom&agrave;tica en Brackets, i aquest mostrar&agrave; una vista en miniatura de la imatge 
            corresponent.
        </p>
        
        <samp>
            Per a provar la previsualitzaci&oacute;, col&middot;loca el cursor sobre l'etiqueta <!-- <body> --> al principi 
            d'aquest document i pressiona <kbd>Cmd/Ctrl + E</kbd> per a obrir un editor CSS. Ara, simplement mou el 
            ratol&iacute; sobre qualsevol dels colors dins del CSS. Tamb&eacute; pots veure'l funcionant en gradients 
            obrint un editor de CSS en l'etiqueta <!-- <html> --> passant el cursor per qualsevol dels valors per a les 
            imatges de fons. Per a provar la vista pr&egrave;via d'imatges, col&middot;loca el cursor sobre la imatge amb 
            la captura de pantalla inclosa abans en aquest document.
        </samp>
        
        <h3>Necessites alguna cosa m&eacute;s? Prova una extensi&oacute;!</h3>
        <p>
            A m&eacute;s de totes les funcions de Brackets, la  nostra amplia comunitat de desenvolupadors d'extensions 
            n'ha creat m&eacute;s d'un centenar que afegeixen funcionalitats &uacute;tils. Si hi ha alguna 
            funcionalitat que necessitis i que Brackets no ho suporti, &eacute;s molt probable que alg&uacute; hagi 
            constru&iuml;t una extensi&oacute; per a aconseguir-la. Per a navegar o buscar en la llista d' extensions 
            disponibles, selecciona <strong>arxiu &gt; Gestionar extensions...</strong> i fes clic en la pestanya 
            "Disponibles". quan trobis una extensi&oacute; que vulguis afegir, simplement pressiona el bot&oacute; 
            "Instal&middot;lar" que hi ha a la dreta.
        </p>

        <!--
            FES-NOS SABER QUE EN PENSES
        -->
        <h2>Involucra't!</h2>
        <p>
            Brackets &eacute;s un projecte de codi obert. Desenvolupadors web de tot el m&oacute;n est&aacute;n 
            contribuint a construir un millor editor de codi. Fes-nos saber qu&egrave; en penses, comparteix les 
            teves idees o contribueix directament en el projecte.
        </p>
        <ul>
            <li><a href="http://brackets.io">Brackets.io</a></li>
            <li><a href="http://blog.brackets.io">Blog de l'equip de Brackets</a></li>
            <li><a href="http://github.com/adobe/brackets">Brackets a GitHub</a></li>
            <li><a href="https://brackets-registry.aboutweb.com">Registre d'extensions de Brackets</a></li>
            <li><a href="http://github.com/adobe/brackets/wiki">Wiki de Brackets</a></li>
            <li><a href="http://groups.google.com/group/brackets-dev">Llista de correu dels desenvolupadors de Brackets</a></li>
            <li><a href="https://twitter.com/#!/brackets">@brackets a Twitter</a></li>
            <li>Parla amb els desenvolupadors de Brackets per IRC a #brackets a Freenode</li>
        </ul>
        
    </body>
</html>
<!--

    [[[[[[[[[[[[[[[     ]]]]]]]]]]]]]]]
    [::::::::::::::     ::::::::::::::]
    [::::::::::::::     ::::::::::::::]
    [::::::[[[[[[[:     :]]]]]]]::::::]
    [:::::[                     ]:::::]
    [:::::[                     ]:::::]
    [:::::[                     ]:::::]
    [:::::[                     ]:::::]
    [:::::[    CODE THE WEB     ]:::::]
    [:::::[  http://brackets.io ]:::::]
    [:::::[                     ]:::::]
    [:::::[                     ]:::::]
    [:::::[                     ]:::::]
    [:::::[                     ]:::::]
    [::::::[[[[[[[:     :]]]]]]]::::::]
    [::::::::::::::     ::::::::::::::]
    [::::::::::::::     ::::::::::::::]
    [[[[[[[[[[[[[[[     ]]]]]]]]]]]]]]]

-->
